CSI API ETABS v1
cDCompColEurocode_4_2004.GetOverwrite Method
 Retrieves the value of a composite column design overwrite item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDCompColEurocode_4_2004
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of a frame object with a composite column design procedure
Item
Type: System.Int32
 This is an integer between 1 and 16, inclusive, indicating the overwrite item considered.
Framing Type
Live load reduction factor
Unbraced length ratio, Ly
Unbraced length ratio, Lz
Effective length factor, Ky
Effective length factor, Kz
Is rolled section
Consider rebar
Column buckling curve, y-y
Column buckling curve, z-z
Material overstrength, GammaOv
Correction factor, Ke
Correction factor, KeII
Calibration factor, K0
Creep coefficient, phi_t
D/C coefficient, alphaM
Value
Type: System.Double
 The numeric value of the considered overwrite item.
 Design Section
 Framing Type
0 = Program Default
1 = DCH-MRF (Ductility Class High - Moment Frame)
2 = DCM-MRF (Ductility Class Medium - Moment Frame)
3 = DCL-MRF (Ductility Class Low - Moment Frame)
4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
10 = Inverted Pendulum Structure
11 = Secondary
12 = Non Seismic
 Unbraced length ratio, Ly
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Lz
 Value >= 0; 0 means use program determined value.
 Effective length factor, Ky
 Value >= 0; 0 means use program determined value.
 Effective length factor, Kz
 Value >= 0; 0 means use program determined value.
 Is rolled section
0 = Program Default
1 = No
2 = Yes
 Consider rebar
0 = Program Default
1 = No
2 = Yes
 Column buckling curve (y-y)
0 = Program Default
1 = a0
2 = a
3 = b
4 = c
5 = d
 Column buckling curve (z-z)
0 = Program Default
1 = a0
2 = a
3 = b
4 = c
5 = d
 Material overstrength, GammaOv
 Value >= 0; 0 means use program determined value.
 Correction factor, Ke
 Value >= 0; 0 means use program determined value.
 Correction factor, KeII
 Value >= 0; 0 means use program determined value.
 Calibration factor, K0
 Value >= 0; 0 means use program determined value.
 Creep coefficient, phi_t
 Value >= 0; 0 means use program determined value.
 D/C coefficient, alphaM
 Value >= 0; 0 means use program determined value.
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set composite column design code
   ret = SapModel.DesignCompositeColumn.SetCode("Eurocode 4-2004")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start composite column design
   ret = SapModel.DesignCompositeColumn.StartDesign
'get overwrite item
   ret = SapModel.DesignCompositeColumn.Eurocode_4_2004.GetOverwrite("8", 2, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColEurocode_4_2004 Interface
ETABSv1 Namespace